Autodesk.Revit.DB.BuiltInFailures.TagByExampleFailures.CannotCreateTagWarning
Tag by Example couldn't tag the host.

Autodesk.Revit.DB.BuiltInFailures.TagByExampleFailures.CannotCreateTagRotationWarning
Tag by Example couldn't tag the host as it is not parallel to the example host.

Autodesk.Revit.DB.BuiltInFailures.TagByExampleFailures.CannotCreateTag
The tag couldn't be created.

Autodesk.Revit.DB.BuiltInFailures.TagByExampleFailures
Failures about Tag by Example.